{ config, pkgs, pkgs-stable, lib, inputs, ... }:

{
  imports = [
    ./hardware-configuration.nix
    ./modules/system
  ];

  # ============================================================
  # bash prompt
  # ============================================================
  
  programs.bash.promptInit = ''
    PROMPT_COLOR="1;31m"
    ((UID)) && PROMPT_COLOR="1;32m"
    PS1="\[\e]0;\u@\h: \w\a\]\[\033[$PROMPT_COLOR\][\u@\h:\w]\\$\[\033[0m\] "
  '';

  # ============================================================
  # i2c
  # ============================================================

  #hardware.i2c.enable = true; # добавить группу "i2c" в users.nix

  # ============================================================
  # System info
  # ============================================================

  system.stateVersion = "26.05"; # меняй на свою когда будешь ставить первый раз
}
